---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.ForwardIterator
source: html/f1148f49-393e-049e-68ae-9ad881728974.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.